// Даден е масив, който съдържа информация за български владетели, и периода на тяхното управление.
// Всеки елемент на масива е масив със следните данни:
// 	[<име>, <начална година на управление>, <крайна година на управление>]

var rulers = [
	["асПАРуХ",681, 700 ],
	["тЕРвеЛ", 700,718 ],
	["СеВаР", 738,753],
	["телЕРИГ", 766,777],
	["каРДАм", 777, 803],
	["крум", 803,814 ],
	["ОмурТАг",814,831],
];



if(rulers[0][2] - rulers[0][1] > 15){
    console.log( toCamelCaseCyr(`асПАРуХ е управлявал ${rulers[0][2] - rulers[0][1]} години.`) );
}

if(rulers[1][2] - rulers[1][1] > 15){
    console.log( toCamelCaseCyr(`тЕРвеЛ е управлявал ${rulers[1][2] - rulers[1][1]} години.`) );
}

if(rulers[2][2] - rulers[2][1] > 15){
    console.log( toCamelCaseCyr(`СеВаР е управлявал ${rulers[2][2] - rulers[2][1]} години.`) );
}

if(rulers[3][2] - rulers[3][1] > 15){
    console.log( toCamelCaseCyr(`телЕРИГ е управлявал ${rulers[3][2] - rulers[3][1]} години.`) );
}
if(rulers[4][2] - rulers[4][1] > 15){
    console.log( toCamelCaseCyr(`каРДАм е управлявал ${rulers[4][2] - rulers[4][1]} години.`) );
}

if(rulers[5][2] - rulers[5][1] > 15){
    console.log( toCamelCaseCyr(`крум е управлявал ${rulers[5][2] - rulers[5][1]} години.`) );
}

if(rulers[6][2] - rulers[6][1] > 15){
    console.log( toCamelCaseCyr(`ОмурТАг е управлявал ${rulers[6][2] - rulers[6][1]} години.`) );
}


// ЗАДАЧА: Изпишете в конзолата имената на онези български владетели, които са управлявали повече от 15 години.
// Разбира се, искаме да видим имената изписани според конвенциите за имена на съществителни-собствени: за целта може да използвате върху всяко име функцията toCamelCaseCyr(), която връща подадения й низ в скобите конвертиран до CamelCase
// Например
	
   
    // Аспарух

// >>>>>>>>>>НАЧАЛО НА ВАШИЯ КОД >>>>>>>>>>



// <<<<<<<<<< КРАЙ НА ВАШИЯ КОД <<<<<<<<<<<<<

// Очакван резултат,в конзолата:
// Аспарух е управлявал 19 години.
// Тервел е управлявал 18 години.
// Кардам е управлявал 26 години.
// Омуртаг е управлявал 17 години.








// do not modify!
function toCamelCaseCyr(str) {
	return str.toLowerCase()
			    	.replace(/(?:\b|^|[^а-яА-Я])([а-яА-Я])/g, (all, chr) => chr.toUpperCase());
}